<a href="https://colab.research.google.com/github/natepearsall/git-test/blob/main/homework/week-13.ipynb" target="_parent"><img src="https://colab.research.google.com/assets/colab-badge.svg" alt="Open In Colab"/></a>

# Homework - Week 13

Complete the following blocks as specified in the directions. Run each cell to return the desired output. Save your notebook back to your GitHub repository and submit the GitHub URL to your notebook for review.

## 1. Change Runtime to R (1 pt)

Change the runtime of this notebook to R. You can verify that you are running R by displaying the current version you are running. Run the cell below and show the output.

In [1]:
version

               _
platform       x86_64-pc-linux-gnu
arch           x86_64
os             linux-gnu
system         x86_64, linux-gnu
status
major          4
minor          3.2
year           2023
month          10
day            31
svn rev        85441
language       R
version.string R version 4.3.2 (2023-10-31)
nickname       Eye Holes

## 2. Create Vectors (2 pts)

Create two vectors in the cells below, according to the prompts given.

In [7]:
# create a vector with 7 integer values. Assign it to a variable named "my_integers"
my_integers <- c(1, 2, 3, 4, 5, 6, 7)

In [8]:
var1 = 8
var2 = 4
var3 = 12
var4 = 25

calculation1 <- var2 / var1
calculation2 <- var2^3 * var3
calculation3 <- as.integer(var4 / var3)

my_calculated_values <- c(calculation1, calculation2, calculation3)

# Using the variables given above, assign three new variables the following calculated values:
#
# 1. Your first variable should be assigned the calculated value of var2 divided by var1.
# 2. Your second variable should be assigned the calculated value of var2 cubed times var3.
# 3. Your third variable should be assigned the calculated value of var4 integer divided by var3.
#
# Next, create an array populated by your three variables. Assign the array to a new variable named "my_calculated_values"

## 3. Vector Indexes (3 pts)

In the cell below, create a vector that starts with the integer 4, that increments by counts of 3 all the way to 28.

Assign the vector to a variable name.

In [5]:
my_vector <- seq(from = 4, to = 28, by = 3)

Next, show how to display this vector with the 3 index removed.

In [6]:
my_vector_without_index3 <- my_vector[-3]

Finally, show how to delete the 4th, 5th, and 7th indexes from the vector and update the vector so they are forever removed from the vector.

Hint: there is a fairly simple way to do this in one line, such that you don't have to run a separate command for each removal.

In [9]:
#
my_vector <- my_vector[-c(4, 5, 7)]

## 4. Create a Data Frame (3 pts)

In the cell below create a data frame with 10 observations (rows) and 5 variables (columns) each. This data frame will describe some of your favorite musical performers. You can use real or fictitious data to populate your data frame.

Variables:
  - `artist` - Artist or band name
  - `category` - Rock, Pop, Country, Hip-hop, Jazz, Classical, Soul, Other. (Try to distribute your selections here)
  - `size` - (number of members, 1-?)
  - `start` - Debut year of artist.
  - `grammy` - Grammmy winner? `TRUE` | `FALSE`

First create vectors for each variable populated with your own performer data. Then create a data frame from these vectors (be sure to assign column names too) and assign it to a named variable such as `df`.

In [10]:

artist <- c("Pink Floyd", "ABBA", "Lana Del Rey", "Eagles", "Modern English",
            "The Smiths", "The Cure", "Fleetwood Mac", "Sublime", "Tyler Childers")

category <- c("Rock", "Pop", "Pop", "Rock", "New Wave", "Indie", "Alternative", "Rock", "Ska", "Country")

size <- c(4, 4, 1, 4, 4, 4, 4, 4, 3, 1)

start <- c(1965, 1972, 2005, 1971, 1979, 1982, 1976, 1967, 1988, 2011)

grammy <- c(TRUE, TRUE, FALSE, TRUE, FALSE, FALSE, TRUE, TRUE, FALSE, FALSE)

df <- data.frame(artist = artist, category = category, size = size, start = start, grammy = grammy)

print(df)

           artist    category size start grammy
1      Pink Floyd        Rock    4  1965   TRUE
2            ABBA         Pop    4  1972   TRUE
3    Lana Del Rey         Pop    1  2005  FALSE
4          Eagles        Rock    4  1971   TRUE
5  Modern English    New Wave    4  1979  FALSE
6      The Smiths       Indie    4  1982  FALSE
7        The Cure Alternative    4  1976   TRUE
8   Fleetwood Mac        Rock    4  1967   TRUE
9         Sublime         Ska    3  1988  FALSE
10 Tyler Childers     Country    1  2011  FALSE

## 5. Filter/Query a Data Frame (2 pts)

Use the data frame you created above and show how to perform the following queries.

In [11]:
# Display the first 3 records and only the `artist`, `category` and `grammy` columns for each.
selected_columns <- c("artist", "category", "grammy")
first_3_records <- head(df[, selected_columns], 3)

print(first_3_records)

        artist category grammy
1   Pink Floyd     Rock   TRUE
2         ABBA      Pop   TRUE
3 Lana Del Rey      Pop  FALSE

In [13]:
# Display the records for just one musical category, such as only Rock bands or only Hip-hop bands.
rock_records <- df[df$category == "Rock", ]
print(rock_records)

         artist category size start grammy
1    Pink Floyd     Rock    4  1965   TRUE
4        Eagles     Rock    4  1971   TRUE
8 Fleetwood Mac     Rock    4  1967   TRUE

## Query a Data Frame using `tidyverse` (4 pts)

1. Show how to load the library.
2. Show how to glimpse basic features of the `starwars` data table.
3. Create a query using tidyverse that retrieves the following data:
    - Selects only these columns: `name`, `height`, `sex`, `species`.
    - Filters for all species that are NOT Human.
    - Arranges the resulting data in order by name.

Show your output in a data frame.

In [15]:
#

install.packages("tidyverse")
library(tidyverse)

data("starwars")


result <- starwars %>%
  select(name, height, sex, species) %>%
  filter(species != "Human") %>%
  arrange(name)

print(result)

Installing package into ‘/usr/local/lib/R/site-library’
(as ‘lib’ is unspecified)

# A tibble: 48 × 4
   name           height sex    species
   <chr>           <int> <chr>  <chr>
 1 Ackbar            180 male   Mon Calamari
 2 Adi Gallia        184 female Tholothian
 3 Ayla Secura       178 female Twi'lek
 4 BB8                NA none   Droid
 5 Barriss Offee     166 female Mirialan
 6 Ben Quadinaros    163 male   Toong
 7 Bib Fortuna       180 male   Twi'lek
 8 Bossk             190 male   Trandoshan
 9 C-3PO             167 none   Droid
10 Chewbacca         228 male   Wookiee
# ℹ 38 more rows